#include "pose_math.h"
#include "math.h"

/*******************************************************************************
* 函 数 名         : Angle_Translate
* 函数功能		     : 将角度转变为-180~180之间
* 输    入         : 
* 输    出         : 
*******************************************************************************/
float translateAngle(float angle)
{
	while (angle > ANGLE_MAX)					//判断目标角度是否在允许角度范围
		angle -= 360.0f;
	while (angle < ANGLE_MIN)
		angle += 360.0f;
	return angle;
}
/*******************************************************************************
* 函 数 名         : sin_pose
* 函数功能		     : 
* 输    入         : 
* 输    出         : 
*******************************************************************************/
float sin_pose(float angle)
{
	float sine, rad;
	angle = translateAngle(angle);
	rad = angle * PI / 180.0f;
	
	sine = (rad < 0) ? rad * (1.27323954f + 0.405284735f * rad) : rad * (1.27323954f - 0.405284735f * rad);
	sine = (sine < 0) ? sine * (-0.225f * (sine + 1) + 1) : sine * (0.225f * (sine - 1) + 1);
	return sine;
}
/*******************************************************************************
* 函 数 名         : Cos_pose
* 函数功能		     : 
* 输    入         : 
* 输    出         : 
*******************************************************************************/
float cos_pose(float angle)
{
	return sin_pose(angle + 90.0f);
}
/*******************************************************************************
* 函 数 名         : Tan_pose
* 函数功能		     : 
* 输    入         : 
* 输    出         : 
*******************************************************************************/
float tan_pose(float angle)
{
	return sin_pose(angle) / cos_pose(angle);
}
/*******************************************************************************
* 函 数 名         : ATan1
* 函数功能		     : 反正切 （+- 0.09°）
* 输    入         : 
* 输    出         : 
*******************************************************************************/
float arctan1(float tan)
{ 
	float angle = (ABS(tan) > 1.0f)	? 																																								\
								90.0f - ABS(1.0f / tan) * (45.0f - (ABS(1.0f / tan) - 1.0f) * (14.0f + 3.83f * ABS(1.0f / tan)))	: \
								ABS(tan) * (45.0f - (ABS(tan) - 1.0f) * (14.0f + 3.83f * ABS(tan)));
	return (tan > 0) ? angle : -angle;
}
/*******************************************************************************
* 函 数 名         : ATan2
* 函数功能		     : 反正切 （+- 0.09°）
* 输    入         : 
* 输    出         : 
*******************************************************************************/
float arctan2(float x, float y)
{
	float tan, angle;
	
	if (x == 0 && y == 0)		//不存在
		return 0;
	
	if (x == 0)							//y轴上
	{
		if (y > 0)
			return 90;
		else
			return -90;
	}
	
	if (y == 0)							//x轴上
	{
		if (x > 0)
			return 0;
		else 
			return -180.0f;
	}
	
	tan = y / x;
	angle = arctan1(tan);
	if (x < 0 && angle > 0)
		angle -= 180.0f;
	else if (x < 0 && angle < 0)
		angle += 180.0f;
	return angle;
}
/*******************************************************************************
* 函 数 名         : arcsin1
* 函数功能		     : 反正切 （+- 0.09°）
* 输    入         : 
* 输    出         : 
*******************************************************************************/
float arcsin(float i)
{
	return arctan1(i / sqrt(1 - i * i));
}
